In [1]:
import numpy as np
import pandas as pd

In [2]:

df = pd.read_csv(r"C:\Users\bhanu\Downloads\cars.csv")

### 1. Display the first 5 rows of the dataset

In [7]:
print(df.head(5))

   S.No.                              Name    Location  Year  \
0      0            Maruti Wagon R LXI CNG      Mumbai  2010
1      1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
2      2                      Honda Jazz V     Chennai  2011
3      3                 Maruti Ertiga VDI     Chennai  2012
4      4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage     KM  \
0              72000       CNG       Manual      First    26.60  km/kg
1              41000    Diesel       Manual      First    19.67   kmpl
2              46000    Petrol       Manual      First    18.20   kmpl
3              87000    Diesel       Manual      First    20.77   kmpl
4              40670    Diesel    Automatic     Second    15.20   kmpl

    Power   MM  New_Price  Price
0   58.16  bhp  19.894324   1.75
1  126.20  bhp  19.894324  12.50
2   88.70  bhp   8.610000   4.50
3   88.76  bhp  19.894324   6.00
4  140.80  bhp  19.894324  17.74

### 2.Check the number of missing values in each column.

In [4]:
print(df.isna().sum())

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
KM                      2
Power                 175
MM                     46
New_Price            6247
Price                1234
dtype: int64

### 3.What is the data type of each column?

In [12]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   float64
 9   KM                 7251 non-null   object
 10  Power              7078 non-null   float64
 11  MM                 7207 non-null   object
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(3), int64(3), object(8)
memory usage: 793.4+ KB
None

### 4.How many unique car models are there?

In [17]:
car_model_unique = set(df['Name']) ## or df['Name'].nunique()
print(len(car_model_unique))

2041

### 5.which columns have null values, how you handle them

In [6]:
df['Mileage'] = df['Mileage'].fillna(df['Mileage'].mean())
df['Power'] = df['Power'].fillna(df['Power'].mean())
df['MM'] = df['MM'].fillna(df['MM'].mode()[0])
df['KM'] = df['KM'].fillna(df['KM'].mode()[0])
df['Price'] = df['Price'].fillna(df['Price'].mean())
df['New_Price'] = df['New_Price'].fillna(df['New_Price'].mean())

print(df.isna().sum())

S.No.                0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
KM                   0
Power                0
MM                   0
New_Price            0
Price                0
dtype: int64

### 6.What is range(min max) of car prices

In [46]:
print(df['Price'].agg(['max','min']))

max    160.00
min      0.44
Name: Price, dtype: float64

### 7. List the top locations with the most cars sold

In [62]:
df.groupby('Location')['Name'].count().sort_values(ascending=False).head(5)

Location
Mumbai        949
Hyderabad     876
Kochi         772
Coimbatore    772
Pune          765
Name: Name, dtype: int64

### 8.which year has the highest number of car listed

In [6]:
grouped=df.groupby('Year')['Name'].count()
max_year = grouped.idxmax()
max_cars = grouped.max() 
print(f"{df['Year'][max_year]}:{max_cars}")

2014:929

### 9.what is the distribution of tramission types in dataset

In [7]:
df['Transmission'].value_counts()

Transmission
Manual       5204
Automatic    2049
Name: count, dtype: int64

### 10. Convert mileage and power columns into float dataye

In [10]:
df.info() #already power and mileage are in float datatype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   float64
 9   KM                 7251 non-null   object
 10  Power              7078 non-null   float64
 11  MM                 7207 non-null   object
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(3), int64(3), object(8)
memory usage: 793.4+ KB

### 11. find the average of selling price of cars by fuel types

In [8]:
df.groupby('Fuel_Type')['Price'].mean()

Fuel_Type
CNG          4.093820
Diesel      12.276053
Electric    12.875000
LPG          3.652411
Petrol       6.359047
Name: Price, dtype: float64

### 12.which city has the highest average car price

In [13]:
df.groupby('Location')['Price'].max().sort_values(ascending=False).head(1)

Location
Hyderabad    160.0
Name: Price, dtype: float64

### 13.calculate the average of mileage of each transmission

In [14]:
df.groupby('Transmission')['Mileage'].mean()

Transmission
Automatic    15.759411
Manual       19.079525
Name: Mileage, dtype: float64

### 14. group the cars by year and count how many cars were listed each year

In [16]:
df.groupby('Year')['Name'].count()

Year
1996      1
1998      4
1999      2
2000      5
2001      8
2002     18
2003     20
2004     35
2005     68
2006     89
2007    148
2008    207
2009    252
2010    407
2011    579
2012    690
2013    791
2014    925
2015    929
2016    886
2017    709
2018    361
2019    119
Name: Name, dtype: int64

### 15. Which car model has the highest average price

In [18]:
df.groupby('Name')['Price'].mean().sort_values(ascending=False).head(1)

Name
Land Rover Range Rover 3.0 Diesel LWB Vogue    160.0
Name: Price, dtype: float64

### 16. Group by owner type and find the average kilometer driven

In [19]:
df.groupby('Owner_Type')['Kilometers_Driven'].mean()

Owner_Type
First              55255.363911
Fourth & Above    119756.500000
Second             72433.625868
Third              87472.729927
Name: Kilometers_Driven, dtype: float64

### 17. What is average power(bhp) of diesel vs petrol

In [25]:
disiel = df[df['Fuel_Type']=='Diesel']
petrol = df[df['Fuel_Type']=='Petrol']
avg = df.groupby('Fuel_Type')['Power'].mean()
print(f"Diesel avg = {avg['Diesel']} Petrol avg {avg['Petrol']}")

Diesel avg = 126.94976364355114 Petrol avg 97.43632862815416

### 18. Group the cars by Fuel type and transmission and calculate the mean price

In [27]:
df.groupby(['Fuel_Type','Transmission'])['Price'].mean()

Fuel_Type  Transmission
CNG        Manual           4.093820
Diesel     Automatic       22.186225
           Manual           7.127454
Electric   Automatic       12.875000
LPG        Manual           3.652411
Petrol     Automatic       10.966255
           Manual           5.062993
Name: Price, dtype: float64

### 19. Which owner type has the highest avg resale value

In [29]:
df.groupby('Owner_Type')['New_Price'].mean()

Owner_Type
First             19.900847
Fourth & Above    19.894324
Second            19.872525
Third             19.794229
Name: New_Price, dtype: float64

### 20. For each city, what is the avarage price of automatic cars

In [31]:
df[df['Transmission']=='Automatic'].groupby('Location')['Price'].mean()

Location
Ahmedabad     15.406841
Bangalore     21.351851
Chennai       16.444055
Coimbatore    23.474621
Delhi         18.320551
Hyderabad     19.452633
Jaipur        13.566043
Kochi         19.773832
Kolkata       14.957679
Mumbai        15.018691
Pune          13.762288
Name: Price, dtype: float64